### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_secret.app_backend_primary_key will be created
  + resource "azurerm_key_vault_secret" "app_backend_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + name                    = "APP-BACKEND-PRIMARY-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cdc_backend_function_key will be created
  + resource "azurerm_key_vault_secret" "cdc_backend_function_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + name                    = "CDC-BACKEND-FUNCTION-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + name                    = "REDIS-PRIMARY-ACCESS-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.backend_func.azurerm_api_management_named_value.cdc_backend_func_key will be updated in-place
  ~ resource "azurerm_api_management_named_value" "cdc_backend_func_key" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/namedValues/io-cdc-backend-func-key"
        name                = "io-cdc-backend-func-key"
        tags                = []
      - value               = (sensitive value) -> null
        # (4 unchanged attributes hidden)

      + value_from_key_vault {
          + secret_id = (sensitive value)
        }
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "TEST_KV_REFERENCE_SECRET"                                                                         = "[REDACTED]" -> null
            # (64 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01"
        name                                           = "io-p-itn-cdc-backend-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "TEST_KV_REFERENCE_SECRET"                                                                         = "[REDACTED]" -> null
            # (65 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on cdc_alerts.tf line 401, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
 401: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 4 more similar warnings elsewhere)
```

</details>
